{"config": [{"config": {"consume_less": "cpu", "name": "lstm_1", "init": "glorot_uniform", "inner_init": "orthogonal", "output_dim": 512, "input_dtype": "float32", "dropout_W": 0.0, "input_dim": 35, "inner_activation": "hard_sigmoid", "return_sequences": true, "batch_input_shape": [1000, 20, 35], "dropout_U": 0.0, "stateful": false, "trainable": true, "b_regularizer": null, "unroll": false, "U_regularizer": null, "go_backwards": false, "activation": "tanh", "W_regularizer": null, "forget_bias_init": "one", "input_length": null}, "class_name": "LSTM"}, {"config": {"trainable": true, "p": 0.2, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"consume_less": "cpu", "name": "lstm_2", "init": "glorot_uniform", "inner_init": "orthogonal", "output_dim": 512, "input_dtype": "float32", "dropout_W": 0.0, "input_dim": 512, "inner_activation": "hard_sigmoid", "return_sequences": true, "batch_input_shape": [1000, 20, 35], "dropout_U": 0.0, "stateful": false, "trainable": true, "b_regularizer": null, "unroll": false, "U_regularizer": null, "go_backwards": false, "activation": "tanh", "W_regularizer": null, "forget_bias_init": "one", "input_length": null}, "class_name": "LSTM"}, {"config": {"trainable": true, "p": 0.2, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"consume_less": "cpu", "name": "lstm_3", "init": "glorot_uniform", "inner_init": "orthogonal", "output_dim": 512, "input_dtype": "float32", "dropout_W": 0.0, "input_dim": 512, "inner_activation": "hard_sigmoid", "return_sequences": false, "batch_input_shape": [1000, 20, 35], "dropout_U": 0.0, "stateful": false, "trainable": true, "b_regularizer": null, "unroll": false, "U_regularizer": null, "go_backwards": false, "activation": "tanh", "W_regularizer": null, "forget_bias_init": "one", "input_length": null}, "class_name": "LSTM"}, {"config": {"activity_regularizer": null, "trainable": true, "name": "dense_1", "bias": true, "init": "glorot_uniform", "W_constraint": null, "output_dim": 320, "b_constraint": null, "activation": "linear", "input_dim": 512, "W_regularizer": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "trainable": true, "name": "dense_2", "bias": true, "init": "glorot_uniform", "W_constraint": null, "output_dim": 35, "b_constraint": null, "activation": "linear", "input_dim": 320, "W_regularizer": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "1.2.0"}