{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "LSTM", "config": {"dropout_W": 0.0, "output_dim": 128, "go_backwards": false, "input_dim": 6343, "inner_init": "orthogonal", "stateful": false, "name": "lstm_1", "init": "glorot_uniform", "input_length": null, "return_sequences": true, "forget_bias_init": "one", "inner_activation": "hard_sigmoid", "input_dtype": "float32", "b_regularizer": null, "dropout_U": 0.0, "unroll": false, "W_regularizer": null, "batch_input_shape": [1000, 20, 6343], "trainable": true, "consume_less": "cpu", "activation": "tanh", "U_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_1"}}, {"class_name": "LSTM", "config": {"dropout_W": 0.0, "output_dim": 128, "go_backwards": false, "input_dim": 128, "inner_init": "orthogonal", "stateful": false, "name": "lstm_2", "init": "glorot_uniform", "input_length": null, "return_sequences": true, "forget_bias_init": "one", "inner_activation": "hard_sigmoid", "input_dtype": "float32", "b_regularizer": null, "dropout_U": 0.0, "unroll": false, "W_regularizer": null, "batch_input_shape": [1000, 20, 6343], "trainable": true, "consume_less": "cpu", "activation": "tanh", "U_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_2"}}, {"class_name": "LSTM", "config": {"dropout_W": 0.0, "output_dim": 128, "go_backwards": false, "input_dim": 128, "inner_init": "orthogonal", "stateful": false, "name": "lstm_3", "init": "glorot_uniform", "input_length": null, "return_sequences": false, "forget_bias_init": "one", "inner_activation": "hard_sigmoid", "input_dtype": "float32", "b_regularizer": null, "dropout_U": 0.0, "unroll": false, "W_regularizer": null, "batch_input_shape": [1000, 20, 6343], "trainable": true, "consume_less": "cpu", "activation": "tanh", "U_regularizer": null}}, {"class_name": "Dense", "config": {"bias": true, "b_regularizer": null, "output_dim": 128, "trainable": true, "input_dim": 128, "W_regularizer": null, "name": "dense_1", "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "activation": "linear"}}, {"class_name": "Dense", "config": {"bias": true, "b_regularizer": null, "output_dim": 6343, "trainable": true, "input_dim": 128, "W_regularizer": null, "name": "dense_2", "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "name": "activation_1"}}]}